GopalSaraf/Practicals/PSDL/include/proc/pic18lf24k42.h
extern volatile SMT1CPRUbits_t SMT1CPRUbits __at(0x3F17);
// bitfield macros
#define _SMT1CPRU_CPR_POSN                                  0x0
#define _SMT1CPRU_CPR_POSITION                              0x0
#define _SMT1CPRU_CPR_SIZE                                  0x8
#define _SMT1CPRU_CPR_LENGTH                                0x8
#define _SMT1CPRU_CPR_MASK                                  0xFF
#define _SMT1CPRU_CPR16_POSN                                0x0
#define _SMT1CPRU_CPR16_POSITION                            0x0
#define _SMT1CPRU_CPR16_SIZE                                0x1
#define _SMT1CPRU_CPR16_LENGTH                              0x1
#define _SMT1CPRU_CPR16_MASK                                0x1
#define _SMT1CPRU_CPR17_POSN                                0x1
#define _SMT1CPRU_CPR17_POSITION                            0x1
#define _SMT1CPRU_CPR17_SIZE                                0x1
#define _SMT1CPRU_CPR17_LENGTH                              0x1
#define _SMT1CPRU_CPR17_MASK                                0x2
#define _SMT1CPRU_CPR18_POSN                                0x2
#define _SMT1CPRU_CPR18_POSITION                            0x2
#define _SMT1CPRU_CPR18_SIZE                                0x1
#define _SMT1CPRU_CPR18_LENGTH                              0x1
#define _SMT1CPRU_CPR18_MASK                                0x4
#define _SMT1CPRU_CPR19_POSN                                0x3
#define _SMT1CPRU_CPR19_POSITION                            0x3
#define _SMT1CPRU_CPR19_SIZE                                0x1
#define _SMT1CPRU_CPR19_LENGTH                              0x1
#define _SMT1CPRU_CPR19_MASK                                0x8
#define _SMT1CPRU_CPR20_POSN                                0x4
#define _SMT1CPRU_CPR20_POSITION                            0x4
#define _SMT1CPRU_CPR20_SIZE                                0x1
#define _SMT1CPRU_CPR20_LENGTH                              0x1
#define _SMT1CPRU_CPR20_MASK                                0x10
#define _SMT1CPRU_CPR21_POSN                                0x5
#define _SMT1CPRU_CPR21_POSITION                            0x5
#define _SMT1CPRU_CPR21_SIZE                                0x1
#define _SMT1CPRU_CPR21_LENGTH                              0x1
#define _SMT1CPRU_CPR21_MASK                                0x20
#define _SMT1CPRU_CPR22_POSN                                0x6
#define _SMT1CPRU_CPR22_POSITION                            0x6
#define _SMT1CPRU_CPR22_SIZE                                0x1
#define _SMT1CPRU_CPR22_LENGTH                              0x1
#define _SMT1CPRU_CPR22_MASK                                0x40
#define _SMT1CPRU_CPR23_POSN                                0x7
#define _SMT1CPRU_CPR23_POSITION                            0x7
#define _SMT1CPRU_CPR23_SIZE                                0x1
#define _SMT1CPRU_CPR23_LENGTH                              0x1
#define _SMT1CPRU_CPR23_MASK                                0x80
#define _SMT1CPRU_SMT1CPR16_POSN                            0x0
#define _SMT1CPRU_SMT1CPR16_POSITION                        0x0
#define _SMT1CPRU_SMT1CPR16_SIZE                            0x1
#define _SMT1CPRU_SMT1CPR16_LENGTH                          0x1
#define _SMT1CPRU_SMT1CPR16_MASK                            0x1
#define _SMT1CPRU_SMT1CPR17_POSN                            0x1
#define _SMT1CPRU_SMT1CPR17_POSITION                        0x1
#define _SMT1CPRU_SMT1CPR17_SIZE                            0x1
#define _SMT1CPRU_SMT1CPR17_LENGTH                          0x1
#define _SMT1CPRU_SMT1CPR17_MASK                            0x2
#define _SMT1CPRU_SMT1CPR18_POSN                            0x2
#define _SMT1CPRU_SMT1CPR18_POSITION                        0x2
#define _SMT1CPRU_SMT1CPR18_SIZE                            0x1
#define _SMT1CPRU_SMT1CPR18_LENGTH                          0x1
#define _SMT1CPRU_SMT1CPR18_MASK                            0x4
#define _SMT1CPRU_SMT1CPR19_POSN                            0x3
#define _SMT1CPRU_SMT1CPR19_POSITION                        0x3
#define _SMT1CPRU_SMT1CPR19_SIZE                            0x1
#define _SMT1CPRU_SMT1CPR19_LENGTH                          0x1
#define _SMT1CPRU_SMT1CPR19_MASK                            0x8
#define _SMT1CPRU_SMT1CPR20_POSN                            0x4
#define _SMT1CPRU_SMT1CPR20_POSITION                        0x4
#define _SMT1CPRU_SMT1CPR20_SIZE                            0x1
#define _SMT1CPRU_SMT1CPR20_LENGTH                          0x1
#define _SMT1CPRU_SMT1CPR20_MASK                            0x10
#define _SMT1CPRU_SMT1CPR21_POSN                            0x5
#define _SMT1CPRU_SMT1CPR21_POSITION                        0x5
#define _SMT1CPRU_SMT1CPR21_SIZE                            0x1
#define _SMT1CPRU_SMT1CPR21_LENGTH                          0x1
#define _SMT1CPRU_SMT1CPR21_MASK                            0x20
#define _SMT1CPRU_SMT1CPR22_POSN                            0x6
#define _SMT1CPRU_SMT1CPR22_POSITION                        0x6
#define _SMT1CPRU_SMT1CPR22_SIZE                            0x1
#define _SMT1CPRU_SMT1CPR22_LENGTH                          0x1
#define _SMT1CPRU_SMT1CPR22_MASK                            0x40
#define _SMT1CPRU_SMT1CPR23_POSN                            0x7
#define _SMT1CPRU_SMT1CPR23_POSITION                        0x7
#define _SMT1CPRU_SMT1CPR23_SIZE                            0x1
#define _SMT1CPRU_SMT1CPR23_LENGTH                          0x1
#define _SMT1CPRU_SMT1CPR23_MASK                            0x80
#define _SMT1CPRU_SMT1CPR_POSN                              0x0
#define _SMT1CPRU_SMT1CPR_POSITION                          0x0
#define _SMT1CPRU_SMT1CPR_SIZE                              0x8
#define _SMT1CPRU_SMT1CPR_LENGTH                            0x8
#define _SMT1CPRU_SMT1CPR_MASK                              0xFF

// Register: SMT1CPW
#define SMT1CPW SMT1CPW
#ifndef __CCI__
extern volatile __uint24                SMT1CPW             __at(0x3F18);
#endif
#ifndef _LIB_BUILD
asm("SMT1CPW equ 03F18h");
#endif

